#language: ru
@Test
Функционал: Яндекс.Маркет

  Сценарий: Подраздел Телевизоры

  Дано Страница загружена
    И Перейти в Яндекс.Маркет
    И Перейти в раздел Электроника
    И Перейти в раздел Телевизоры
    И Нажать кнопку Все фильтры
    И Установить значение Цена от 20000
    И Выбрать производителя Samsung
    И Выбрать производителя LG
    И Нажать кнопку Показать подходящие
    И Выбрать фильтр Показывать по 12
    И Проверить, что на странице 12 элементов
    И Выбрать первый элемент
    И Найти товар
    И Проверить результат поиска




